In [1]:
import pandas as pd

In [2]:
stores = [
    {'watches': 2, 'bananas': 10, 'bike': 4, 'eggs': 2, 'milk': 10, 'car': 2},
    {'eggs': 20, 'bananas': 2, 'bike': 10, 'milk': 20},
    {'eggs': 10, 'bananas': 10, 'milk': 3, 'car': 1}
]

In [3]:
shop = pd.DataFrame(stores, index=['store1', 'store2', 'store3'])
shop

        watches  bananas  bike  eggs  milk  car
store1      2.0       10   4.0     2    10  2.0
store2      NaN        2  10.0    20    20  NaN
store3      NaN       10   NaN    10     3  1.0

In [4]:
shop.isnull().sum()

watches    2
bananas    0
bike       1
eggs       0
milk       0
car        1
dtype: int64

In [5]:
shop.isnull().sum().sum()

4

In [6]:
shop.count()

watches    1
bananas    3
bike       2
eggs       3
milk       3
car        2
dtype: int64

In [7]:
shop.dropna(axis=0)

        watches  bananas  bike  eggs  milk  car
store1      2.0       10   4.0     2    10  2.0

In [8]:
shop.dropna(axis=1)

        bananas  eggs  milk
store1       10     2    10
store2        2    20    20
store3       10    10     3

In [9]:
shop.fillna(0)

        watches  bananas  bike  eggs  milk  car
store1      2.0       10   4.0     2    10  2.0
store2      0.0        2  10.0    20    20  0.0
store3      0.0       10   0.0    10     3  1.0

In [13]:
shop.fillna(method='ffill', axis=0)

        watches  bananas  bike  eggs  milk  car
store1      2.0       10   4.0     2    10  2.0
store2      2.0        2  10.0    20    20  2.0
store3      2.0       10  10.0    10     3  1.0

In [14]:
shop.fillna(method='ffill', axis=1)

        watches  bananas  bike  eggs  milk   car
store1      2.0     10.0   4.0   2.0  10.0   2.0
store2      NaN      2.0  10.0  20.0  20.0  20.0
store3      NaN     10.0  10.0  10.0   3.0   1.0

In [15]:
shop.fillna(method='backfill', axis=0)

        watches  bananas  bike  eggs  milk  car
store1      2.0       10   4.0     2    10  2.0
store2      NaN        2  10.0    20    20  1.0
store3      NaN       10   NaN    10     3  1.0

In [16]:
shop.fillna(method='backfill', axis=1)

        watches  bananas  bike  eggs  milk  car
store1      2.0     10.0   4.0   2.0  10.0  2.0
store2      2.0      2.0  10.0  20.0  20.0  NaN
store3     10.0     10.0  10.0  10.0   3.0  1.0

In [17]:
shop.interpolate(method='linear', axis=0)

        watches  bananas  bike  eggs  milk  car
store1      2.0       10   4.0     2    10  2.0
store2      2.0        2  10.0    20    20  1.5
store3      2.0       10  10.0    10     3  1.0

In [18]:
shop.interpolate(method='linear', axis=1)

        watches  bananas  bike  eggs  milk   car
store1      2.0     10.0   4.0   2.0  10.0   2.0
store2      NaN      2.0  10.0  20.0  20.0  20.0
store3      NaN     10.0  10.0  10.0   3.0   1.0